//==================================================================================================

// (C) Copyright 2019 ФГУП ГосНИИАС

// Разработан Институтом Системного Программирования РАН

// г. Москва, Россия

//

// Операционная система реального времени

// Компонент:  String Functions

// Файл:       string_functions.c

// Назначение: Предоставляет функции для работы со строками.

// Состав:

//   - MemCopy

//   - MemFill

//   - StringIsEqual

//--------------------------------------------------------------------------------------------------

// История изменений:

// номер дата     | Фамилия И.О.   | ЗИ   | описание

//--------------------------------------------------------------------------------------------------

//     |          |                |      |

//==================================================================================================

//--------------------------------------------------------------------------------------------------

// Включаемые файлы

//--------------------------------------------------------------------------------------------------

include <jet_types.h>

include <strings.h>

//--------------------------------------------------------------------------------------------------

// Макроопределения

//--------------------------------------------------------------------------------------------------


//--------------------------------------------------------------------------------------------------

// Объявления и определения типов

//--------------------------------------------------------------------------------------------------


//--------------------------------------------------------------------------------------------------

// Объявления функций

//--------------------------------------------------------------------------------------------------


//--------------------------------------------------------------------------------------------------

// Определения глобальных переменных

//--------------------------------------------------------------------------------------------------


//--------------------------------------------------------------------------------------------------

// Определения статических переменных

//--------------------------------------------------------------------------------------------------


//--------------------------------------------------------------------------------------------------

// Определения приватных переменных

//--------------------------------------------------------------------------------------------------


//**************************************************************************************************

// Определения функций

//**************************************************************************************************


//==================================================================================================

// Функция: MemCopy

// Назначение: Копирует байты из одной области памяти в другую.

//--------------------------------------------------------------------------------------------------

// Идентификаторы требований: 2765

//--------------------------------------------------------------------------------------------------

// Параметры:

// dst (out) - указатель на область памяти, куда копируются байты

// src (in) - указатель на область памяти, откуда копируются байты

// length (in) - количество копируемых байтов

//

// Возвращаемое значение:

// Отсутствует.

//

// Примечания:

// Заданные области памяти не пересекаются.

//==================================================================================================

VOID MemCopy(VOID* dst, CONST VOID* src, SIZE_TYPE length)

{

  // синоним аргумента dst, преобразованного к типу UINT8*

  UINT8* destination = dst;

  // синоним аргумента src, преобразованного к типу UINT8*

  CONST UINT8* source = src;

  // Цикл по всем копируемым байтам

  for (SIZE_TYPE i = 0; i < length; i++)

  {

    destination[i] = source[i];

  }

}


//==================================================================================================

// Функция: MemFill

// Назначение: Заполняет область памяти заданным значением.

//--------------------------------------------------------------------------------------------------

// Идентификаторы требований: 2769

//--------------------------------------------------------------------------------------------------

// Параметры:

// mem (out) - указатель на область памяти

// fillValue (in) - значение для заполнения

// length (in) - размер области памяти

//

// Возвращаемое значение:

// Отсутствует.

//==================================================================================================

VOID MemFill(VOID* mem, UINT8 fillValue, SIZE_TYPE length)

{

  // синоним аргумента mem, преобразованного к типу UINT8*

  UINT8* destination = mem;

  // Цикл по всем заполняемым байтам

  for (SIZE_TYPE i = 0; i < length; i++)

  {

    destination[i] = fillValue;

  }

}


//==================================================================================================

// Функция: StringIsEqual

// Назначение: Сравнивает две строки на равенство.

//--------------------------------------------------------------------------------------------------

// Идентификаторы требований: 2775, 2776, 2777

//--------------------------------------------------------------------------------------------------

// Параметры:

// first (in) - строка для сравнения

// second (in) - строка для сравнения

//

// Возвращаемое значение:

// Функция возвращает результат сравнения:

//   TRUE - Строки равны.

//   FALSE - Строки не равны.

//==================================================================================================

BOOL StringIsEqual(CONST CHAR* first, CONST CHAR* second)

{

  SIZE_TYPE index; // индекс проверяемого символа

  // Цикл по всем ненулевым символам строки first

  for (index = 0; first[index]; index++)

  {

    if (first[index] != second[index])

    { // символы с индексом index в строках first и second различны

      break;

    }

  }

  // строки совпадают только, если в цикле обе строки были пройдены до конца

  return (first[index] == 0) && (second[index] == 0);

}
